In [19]:
import pandas as pd
import numpy as np

In [34]:
df = pd.read_csv(r'D:\Purwadhika\belajar aja\learning\capstone_3\data\data_travel_insurance.csv')
df.head()

,Agency,Agency Type,Distribution Channel,Product Name,Gender,Duration,Destination,Net Sales,Commision (in value),Age,Claim
0,C2B,Airlines,Online,Annual Silver Plan,F,365,SINGAPORE,216.0,54.0,57,No
1,EPX,Travel Agency,Online,Cancellation Plan,NaN,4,MALAYSIA,10.0,0.0,33,No
2,JZI,Airlines,Online,Basic Plan,M,19,INDIA,22.0,7.7,26,No
3,EPX,Travel Agency,Online,2 way Comprehensive Plan,NaN,20,UNITED STATES,112.0,0.0,59,No
4,C2B,Airlines,Online,Bronze Plan,M,8,SINGAPORE,16.0,4.0,28,No

In [36]:
df['Claim'].value_counts()

Claim
No     43651
Yes      677
Name: count, dtype: int64

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 44328 entries, 0 to 44327
Data columns (total 11 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Agency                44328 non-null  object
 1   Agency Type           44328 non-null  object
 2   Distribution Channel  44328 non-null  object
 3   Product Name          44328 non-null  object
 4   Gender                12681 non-null  object
 5   Duration              44328 non-null  int64
 6   Destination           44328 non-null  object
 7   Net Sales             44328 non-null  float64
 8   Commision (in value)  44328 non-null  float64
 9   Age                   44328 non-null  int64
 10  Claim                 44328 non-null  object
dtypes: float64(2), int64(2), object(7)
memory usage: 3.7+ MB

In [22]:
df.describe()

           Duration     Net Sales  Commision (in value)           Age
count  44328.000000  44328.000000          44328.000000  44328.000000
mean      49.424292     40.550948              9.707692     39.925600
std      109.153961     48.661970             19.625637     13.954926
min       -1.000000   -357.500000              0.000000      0.000000
25%        9.000000     18.000000              0.000000     35.000000
50%       22.000000     26.500000              0.000000     36.000000
75%       53.000000     48.000000             11.550000     43.000000
max     4881.000000    810.000000            283.500000    118.000000

**hasil cek kolom**

Ada 7 kolom tipe categorical ('Agency', 'Agency Type', 'Distribution Channel', 'Product Name', 'Claim', 'Destination', 'Gender')<br>
Ada 4 kolom tipe numerik (Duration, Net Sales, Commision (in value), Age)

**cek data kosong atau NULL**

In [23]:
df.isna().sum()

Agency                      0
Agency Type                 0
Distribution Channel        0
Product Name                0
Gender                  31647
Duration                    0
Destination                 0
Net Sales                   0
Commision (in value)        0
Age                         0
Claim                       0
dtype: int64

In [24]:
df.isnull().sum()

Agency                      0
Agency Type                 0
Distribution Channel        0
Product Name                0
Gender                  31647
Duration                    0
Destination                 0
Net Sales                   0
Commision (in value)        0
Age                         0
Claim                       0
dtype: int64

**Hasil cek null dan NaN**

Terdapat data null pada kolom Gender

# Data Preprocessing

proses preprocessing meliputi proses berikut
<br> 1. Clean data duplikat
<br> 2. Hapus kolom gender (dikarenakan tidak diperlukan)
<br> 3. Hapus row dengan negative value dari kolom net sales dan duration (karena tidak make sense)
<br> 4. Ubah data kategorical ke bentuk numerical

## clean duplikat data

In [25]:
print(f'ada {str(df.duplicated().sum())} data duplikat')

ada 4667 data duplikat

In [26]:
#cari duplikat data
duplicate_data = df.duplicated()
#buat df baru untuk duplikate data
duplicates_df = df[duplicate_data]
#apus data duplikat pada df utama
df = df.drop_duplicates()

In [27]:
print(f'ada {str(df.duplicated().sum())} data duplikat')

ada 0 data duplikat

In [28]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 39661 entries, 0 to 44327
Data columns (total 11 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Agency                39661 non-null  object
 1   Agency Type           39661 non-null  object
 2   Distribution Channel  39661 non-null  object
 3   Product Name          39661 non-null  object
 4   Gender                11994 non-null  object
 5   Duration              39661 non-null  int64
 6   Destination           39661 non-null  object
 7   Net Sales             39661 non-null  float64
 8   Commision (in value)  39661 non-null  float64
 9   Age                   39661 non-null  int64
 10  Claim                 39661 non-null  object
dtypes: float64(2), int64(2), object(7)
memory usage: 3.6+ MB

In [29]:
#hapus kolom gender
df = df.drop('Gender', axis=1)

In [30]:
#hapus data dengan kolom duration dan net sales negatif
df=df.drop(index=df[df['Duration']<0].index.values)
df=df.drop(index=df[df['Net Sales']<0].index.values)

In [31]:
df.describe()

           Duration     Net Sales  Commision (in value)           Age
count  39181.000000  39181.000000          39181.000000  39181.000000
mean      52.090273     43.598444             10.275857     39.925091
std      113.882068     48.691884             20.217018     13.494348
min        0.000000      0.000000              0.000000      0.000000
25%       10.000000     19.800000              0.000000     35.000000
50%       24.000000     29.000000              0.000000     36.000000
75%       56.000000     50.000000             11.880000     45.000000
max     4881.000000    810.000000            283.500000    118.000000

In [32]:
len(df)

39181

In [33]:
df.to_csv(r'D:\Purwadhika\belajar aja\learning\capstone_3\data\data_travel_insurance_prep.csv',sep='|', index=False)
# df.to_csv(r'D:\Gawe\projects_learning\capstone_3\data\data_travel_insurance_prep.csv',sep='|', index=False) ini path lokal aku